/* automatically generated by rust-bindgen */

pub const TJ_NUMSAMP: u32 = 6;
pub const TJ_NUMPF: u32 = 12;
pub const TJ_NUMCS: u32 = 5;
pub const TJFLAG_BOTTOMUP: u32 = 2;
pub const TJFLAG_FASTUPSAMPLE: u32 = 256;
pub const TJFLAG_NOREALLOC: u32 = 1024;
pub const TJFLAG_FASTDCT: u32 = 2048;
pub const TJFLAG_ACCURATEDCT: u32 = 4096;
pub const TJFLAG_STOPONWARNING: u32 = 8192;
pub const TJFLAG_PROGRESSIVE: u32 = 16384;
pub const TJ_NUMERR: u32 = 2;
pub const TJ_NUMXOP: u32 = 8;
pub const TJXOPT_PERFECT: u32 = 1;
pub const TJXOPT_TRIM: u32 = 2;
pub const TJXOPT_CROP: u32 = 4;
pub const TJXOPT_GRAY: u32 = 8;
pub const TJXOPT_NOOUTPUT: u32 = 16;
pub const TJXOPT_PROGRESSIVE: u32 = 32;
pub const TJXOPT_COPYNONE: u32 = 64;
pub const TJFLAG_FORCEMMX: u32 = 8;
pub const TJFLAG_FORCESSE: u32 = 16;
pub const TJFLAG_FORCESSE2: u32 = 32;
pub const TJFLAG_FORCESSE3: u32 = 128;
pub const NUMSUBOPT: u32 = 6;
pub const TJ_BGR: u32 = 1;
pub const TJ_BOTTOMUP: u32 = 2;
pub const TJ_FORCEMMX: u32 = 8;
pub const TJ_FORCESSE: u32 = 16;
pub const TJ_FORCESSE2: u32 = 32;
pub const TJ_ALPHAFIRST: u32 = 64;
pub const TJ_FORCESSE3: u32 = 128;
pub const TJ_FASTUPSAMPLE: u32 = 256;
pub const TJ_YUV: u32 = 512;
#[doc = " 4:4:4 chrominance subsampling (no chrominance subsampling).  The JPEG or"]
#[doc = " YUV image will contain one chrominance component for every pixel in the"]
#[doc = " source image."]
pub const TJSAMP_TJSAMP_444: TJSAMP = 0;

#[doc = " only be decompressed to CMYK pixels."]
pub const TJCS_TJCS_CMYK: TJCS = 3;
#[doc = " YCCK colorspace.  YCCK (AKA \"YCbCrK\") is not an absolute colorspace but"]
#[doc = " rather a mathematical transformation of CMYK designed solely for storage"]
#[doc = " and transmission.  It is to CMYK as YCbCr is to RGB.  CMYK pixels can be"]
#[doc = " reversibly transformed into YCCK, and as with YCbCr, the chrominance"]
#[doc = " components in the YCCK pixels can be subsampled without incurring major"]
#[doc = " perceptual loss.  YCCK JPEG images can only be compressed from and"]
#[doc = " decompressed to CMYK pixels."]
pub const TJCS_TJCS_YCCK: TJCS = 4;
#[doc = " JPEG colorspaces"]
pub type TJCS = u32;
#[doc = " The error was non-fatal and recoverable, but the image may still be"]
#[doc = " corrupt."]
pub const TJERR_TJERR_WARNING: TJERR = 0;
#[doc = " The error was fatal and non-recoverable."]
pub const TJERR_TJERR_FATAL: TJERR = 1;
#[doc = " Error codes"]
pub type TJERR = u32;
#[doc = " Do not transform the position of the image pixels"]
pub const TJXOP_TJXOP_NONE: TJXOP = 0;
#[doc = " Flip (mirror) image horizontally.  This transform is imperfect if there"]
#[doc = " are any partial MCU blocks on the right edge (see #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_HFLIP: TJXOP = 1;
#[doc = " Flip (mirror) image vertically.  This transform is imperfect if there are"]
#[doc = " any partial MCU blocks on the bottom edge (see #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_VFLIP: TJXOP = 2;
#[doc = " Transpose image (flip/mirror along upper left to lower right axis.)  This"]
#[doc = " transform is always perfect."]
pub const TJXOP_TJXOP_TRANSPOSE: TJXOP = 3;
#[doc = " Transverse transpose image (flip/mirror along upper right to lower left"]
#[doc = " axis.)  This transform is imperfect if there are any partial MCU blocks in"]
#[doc = " the image (see #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_TRANSVERSE: TJXOP = 4;
#[doc = " Rotate image clockwise by 90 degrees.  This transform is imperfect if"]
#[doc = " there are any partial MCU blocks on the bottom edge (see"]
#[doc = " #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_ROT90: TJXOP = 5;
#[doc = " Rotate image 180 degrees.  This transform is imperfect if there are any"]
#[doc = " partial MCU blocks in the image (see #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_ROT180: TJXOP = 6;
#[doc = " Rotate image counter-clockwise by 90 degrees.  This transform is imperfect"]
#[doc = " if there are any partial MCU blocks on the right edge (see"]
#[doc = " #TJXOPT_PERFECT.)"]
pub const TJXOP_TJXOP_ROT270: TJXOP = 7;
#[doc = " Transform operations for #tjTransform()"]
pub type TJXOP = u32;
#[doc = " Scaling factor"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tjscalingfactor {
    #[doc = " Numerator"]
    pub num: ::std::os::raw::c_int,
    #[doc = " Denominator"]
    pub denom: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_tjscalingfactor() {
    assert_eq!(
        ::std::mem::size_of::<tjscalingfactor>(),
        8usize,
        concat!("Size of: ", stringify!(tjscalingfactor))
    );
    assert_eq!(
        ::std::mem::align_of::<tjscalingfactor>(),
        4usize,
        concat!("Alignment of ", stringify!(tjscalingfactor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tjscalingfactor>())).num as *const _ as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(tjscalingfactor),
        "::",
        stringify!(num)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tjscalingfactor>())).denom as *const _ as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(tjscalingfactor),
        "::",
        stringify!(denom)
        )
    );
}
#[doc = " Cropping region"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tjregion {
    #[doc = " The left boundary of the cropping region.  This must be evenly divisible"]
    #[doc = " by the MCU block width (see #tjMCUWidth.)"]
    pub x: ::std::os::raw::c_int,
    #[doc = " The upper boundary of the cropping region.  This must be evenly divisible"]
    #[doc = " by the MCU block height (see #tjMCUHeight.)"]
    pub y: ::std::os::raw::c_int,
    #[doc = " The width of the cropping region. Setting this to 0 is the equivalent of"]
    #[doc = " setting it to the width of the source JPEG image - x."]
    pub w: ::std::os::raw::c_int,
    #[doc = " The height of the cropping region. Setting this to 0 is the equivalent of"]
    #[doc = " setting it to the height of the source JPEG image - y."]
    pub h: ::std::os::raw::c_int,
}
#[test]
fn bindgen_test_layout_tjregion() {
    assert_eq!(
        ::std::mem::size_of::<tjregion>(),
        16usize,
        concat!("Size of: ", stringify!(tjregion))
    );
    assert_eq!(
        ::std::mem::align_of::<tjregion>(),
        4usize,
        concat!("Alignment of ", stringify!(tjregion))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tjregion>())).x as *const _ as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(tjregion),
        "::",
        stringify!(x)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tjregion>())).y as *const _ as usize },
        4usize,
        concat!(
        "Offset of field: ",
        stringify!(tjregion),
        "::",
        stringify!(y)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tjregion>())).w as *const _ as usize },
        8usize,
        concat!(
        "Offset of field: ",
        stringify!(tjregion),
        "::",
        stringify!(w)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tjregion>())).h as *const _ as usize },
        12usize,
        concat!(
        "Offset of field: ",
        stringify!(tjregion),
        "::",
        stringify!(h)
        )
    );
}
#[doc = " Lossless transform"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct tjtransform {
    #[doc = " Cropping region"]
    pub r: tjregion,
    #[doc = " One of the @ref TJXOP \"transform operations\""]
    pub op: ::std::os::raw::c_int,
    #[doc = " The bitwise OR of one of more of the @ref TJXOPT_CROP \"transform options\""]
    pub options: ::std::os::raw::c_int,
    #[doc = " Arbitrary data that can be accessed within the body of the callback"]
    #[doc = " function"]
    pub data: *mut ::std::os::raw::c_void,
    #[doc = " A callback function that can be used to modify the DCT coefficients"]
    #[doc = " after they are losslessly transformed but before they are transcoded to a"]
    #[doc = " new JPEG image.  This allows for custom filters or other transformations"]
    #[doc = " to be applied in the frequency domain."]
    #[doc = ""]
    #[doc = " @param coeffs pointer to an array of transformed DCT coefficients.  (NOTE:"]
    #[doc = " this pointer is not guaranteed to be valid once the callback returns, so"]
    #[doc = " applications wishing to hand off the DCT coefficients to another function"]
    #[doc = " or library should make a copy of them within the body of the callback.)"]
    #[doc = ""]
    #[doc = " @param arrayRegion #tjregion structure containing the width and height of"]
    #[doc = " the array pointed to by <tt>coeffs</tt> as well as its offset relative to"]
    #[doc = " the component plane.  TurboJPEG implementations may choose to split each"]
    #[doc = " component plane into multiple DCT coefficient arrays and call the callback"]
    #[doc = " function once for each array."]
    #[doc = ""]
    #[doc = " @param planeRegion #tjregion structure containing the width and height of"]
    #[doc = " the component plane to which <tt>coeffs</tt> belongs"]
    #[doc = ""]
    #[doc = " @param componentID ID number of the component plane to which"]
    #[doc = " <tt>coeffs</tt> belongs (Y, Cb, and Cr have, respectively, ID's of 0, 1,"]
    #[doc = " and 2 in typical JPEG images.)"]
    #[doc = ""]
    #[doc = " @param transformID ID number of the transformed image to which"]
    #[doc = " <tt>coeffs</tt> belongs.  This is the same as the index of the transform"]
    #[doc = " in the <tt>transforms</tt> array that was passed to #tjTransform()."]
    #[doc = ""]
    #[doc = " @param transform a pointer to a #tjtransform structure that specifies the"]
    #[doc = " parameters and/or cropping region for this transform"]
    #[doc = ""]
    #[doc = " @return 0 if the callback was successful, or -1 if an error occurred."]
    pub customFilter: ::std::option::Option<
        unsafe extern "C" fn(
            coeffs: *mut ::std::os::raw::c_short,
            arrayRegion: tjregion,
            planeRegion: tjregion,
            componentIndex: ::std::os::raw::c_int,
            transformIndex: ::std::os::raw::c_int,
            transform: *mut tjtransform,
        ) -> ::std::os::raw::c_int,
    >,
}
#[test]
fn bindgen_test_layout_tjtransform() {
    assert_eq!(
        ::std::mem::size_of::<tjtransform>(),
        40usize,
        concat!("Size of: ", stringify!(tjtransform))
    );
    assert_eq!(
        ::std::mem::align_of::<tjtransform>(),
        8usize,
        concat!("Alignment of ", stringify!(tjtransform))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tjtransform>())).r as *const _ as usize },
        0usize,
        concat!(
        "Offset of field: ",
        stringify!(tjtransform),
        "::",
        stringify!(r)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tjtransform>())).op as *const _ as usize },
        16usize,
        concat!(
        "Offset of field: ",
        stringify!(tjtransform),
        "::",
        stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tjtransform>())).options as *const _ as usize },
        20usize,
        concat!(
        "Offset of field: ",
        stringify!(tjtransform),
        "::",
        stringify!(options)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tjtransform>())).data as *const _ as usize },
        24usize,
        concat!(
        "Offset of field: ",
        stringify!(tjtransform),
        "::",
        stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<tjtransform>())).customFilter as *const _ as usize },
        32usize,
        concat!(
        "Offset of field: ",
        stringify!(tjtransform),
        "::",
        stringify!(customFilter)
        )
    );
}
#[doc = " TurboJPEG instance handle"]
pub type tjhandle = *mut ::std::os::raw::c_void;
extern "C" {
    #[doc = " Create a TurboJPEG compressor instance."]
    #[doc = ""]
    #[doc = " @return a handle to the newly-created instance, or NULL if an error"]
    #[doc = " occurred (see #tjGetErrorStr2().)"]
    pub fn tjInitCompress() -> tjhandle;
}
extern "C" {
    #[doc = " Compress an RGB, grayscale, or CMYK image into a JPEG image."]
    #[doc = ""]
    #[doc = " @param handle a handle to a TurboJPEG compressor or transformer instance"]
    #[doc = ""]
    #[doc = " @param srcBuf pointer to an image buffer containing RGB, grayscale, or"]
    #[doc = " CMYK pixels to be compressed"]
    #[doc = ""]
    #[doc = " @param width width (in pixels) of the source image"]
    #[doc = ""]
